ab-tests/pokijan.jpg/ab_multiprocessing_c50.txt
C:\xampp\apache\bin>ab -n 1000 -c 50 -s 86400 http://192.168.2.19:20001/rfc2616.pdf
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /rfc2616.pdf
Document Length:        550562 bytes

Concurrency Level:      50
Time taken for tests:   601.345 seconds
Complete requests:      1000
Failed requests:        142
   (Connect: 0, Receive: 0, Length: 142, Exceptions: 0)
Total transferred:      472507464 bytes
HTML transferred:       472382196 bytes
Requests per second:    1.66 [#/sec] (mean)
Time per request:       30067.265 [ms] (mean)
Time per request:       601.345 [ms] (mean, across all concurrent requests)
Transfer rate:          767.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.9      1       7
Processing:   119 26744 46204.4   4385  256007
Waiting:        0 7351 15175.2   1759  130912
Total:        120 26744 46204.4   4386  256007

Percentage of the requests served within a certain time (ms)
  50%   4386
  66%   8265
  75%  17318
  80%  35968
  90%  130721
  95%  133125
  98%  133712
  99%  134098
 100%  256007 (longest request)