ab-tests/pokijan.jpg/ab_multithreading_c10.txt
C:\xampp\apache\bin>ab -n 1000 -c 10 -s 86400 http://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      10
Time taken for tests:   147.983 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      15846000 bytes
HTML transferred:       15706000 bytes
Requests per second:    6.76 [#/sec] (mean)
Time per request:       1479.828 [ms] (mean)
Time per request:       147.983 [ms] (mean, across all concurrent requests)
Transfer rate:          104.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       2
Processing:     5 1453 1282.3   1249   17167
Waiting:        4 1419 1269.5   1211   17151
Total:          5 1454 1282.3   1249   17167

Percentage of the requests served within a certain time (ms)
  50%   1249
  66%   1737
  75%   2066
  80%   2247
  90%   2736
  95%   3487
  98%   4172
  99%   4981
 100%  17167 (longest request)