ab-tests/pokijan.jpg/ab_multithreading_c100.txt
C:\xampp\apache\bin>ab -n 1000 -c 100 -s 86400 http://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      100
Time taken for tests:   157.580 seconds
Complete requests:      1000
Failed requests:        48
   (Connect: 0, Receive: 0, Length: 48, Exceptions: 0)
Total transferred:      15085392 bytes
HTML transferred:       14952112 bytes
Requests per second:    6.35 [#/sec] (mean)
Time per request:       15758.001 [ms] (mean)
Time per request:       157.580 [ms] (mean, across all concurrent requests)
Transfer rate:          93.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       2
Processing:    64 11164 26585.6   2262  134116
Waiting:        0 5502 11626.1   1994   72508
Total:         65 11164 26585.6   2262  134117

Percentage of the requests served within a certain time (ms)
  50%   2262
  66%   3873
  75%   5213
  80%   8172
  90%  19733
  95%  68833
  98%  111479
  99%  130354
 100%  134117 (longest request)