ab-tests/pokijan.jpg/ab_multithreading_c150.txt
C:\xampp\apache\bin>ab -n 1000 -c 150 -s 86400 http://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      150
Time taken for tests:   227.145 seconds
Complete requests:      1000
Failed requests:        77
   (Connect: 0, Receive: 0, Length: 77, Exceptions: 0)
Total transferred:      14625858 bytes
HTML transferred:       14496638 bytes
Requests per second:    4.40 [#/sec] (mean)
Time per request:       34071.693 [ms] (mean)
Time per request:       227.145 [ms] (mean, across all concurrent requests)
Transfer rate:          62.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      1       2
Processing:    89 22437 53807.8   2794  227112
Waiting:        0 7343 15372.9   2096  117937
Total:         89 22437 53807.8   2794  227113

Percentage of the requests served within a certain time (ms)
  50%   2794
  66%   5152
  75%   9034
  80%  16924
  90%  66781
  95%  227019
  98%  227060
  99%  227071
 100%  227113 (longest request)