ab-tests/pokijan.jpg/ab_multithreading_secure_c10.txt
C:\xampp\apache\bin>abs -n 1000 -c 10 -s 86400 https://192.168.2.19:20001/pokijan.jpg
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.2.19 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
SSL handshake failed (5).
Completed 900 requests
SSL handshake failed (5).
Completed 1000 requests
Finished 1000 requests


Server Software:        myserver/1.0
Server Hostname:        192.168.2.19
Server Port:            20001
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits

Document Path:          /pokijan.jpg
Document Length:        15706 bytes

Concurrency Level:      10
Time taken for tests:   376.491 seconds
Complete requests:      1000
Failed requests:        2
   (Connect: 0, Receive: 0, Length: 2, Exceptions: 0)
Total transferred:      15814308 bytes
HTML transferred:       15674588 bytes
Requests per second:    2.66 [#/sec] (mean)
Time per request:       3764.911 [ms] (mean)
Time per request:       376.491 [ms] (mean, across all concurrent requests)
Transfer rate:          41.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0 1973 4089.1    996   66020
Processing:     3 1614 5950.7   1193  132768
Waiting:        2 1308 926.6   1142    4748
Total:         11 3587 7268.7   2416  132768

Percentage of the requests served within a certain time (ms)
  50%   2416
  66%   3286
  75%   3962
  80%   4421
  90%   6334
  95%   9352
  98%  18133
  99%  20590
 100%  132768 (longest request)